import numpy as np

# 通用计算
arr = np.array([1, 2, 3, 4])

# 指数函数
# [ 2.71828183  7.3890561  20.08553692 54.59815003]
print(np.exp(arr))

# 正弦、余弦、正切函数
# [ 0.84147098  0.90929743  0.14112001 -0.7568025 ]
print(np.sin(arr))
# [ 0.54030231 -0.41614684 -0.9899925  -0.65364362]
print(np.cos(arr))
# [ 1.55740772 -2.18503986 -0.14254654  1.15782128]
print(np.tan(arr))

# 开方函数
# [1.         1.41421356 1.73205081 2.        ]
print(np.sqrt(arr))

# 加法，与+功能一致，参与运算的两个数组（矩阵），规格（shapes）必须一致
# [ 2  5  8 11]
print(np.add(arr, np.array([1, 3, 5, 7])))
